espressif/esp-idf/components/soc/esp32s31/register/soc/pvt_struct.h
/** Type of dly_num_rec0 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site0_delay_num_vt0_max_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt0_max_record:8;
        /** site0_delay_num_vt1_max_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt1_max_record:8;
        /** site0_delay_num_vt2_max_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt2_max_record:8;
        /** site0_delay_num_vt3_max_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt3_max_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec0_reg_t;

/** Type of dly_num_rec1 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site1_delay_num_vt0_max_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt0_max_record:8;
        /** site1_delay_num_vt1_max_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt1_max_record:8;
        /** site1_delay_num_vt2_max_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt2_max_record:8;
        /** site1_delay_num_vt3_max_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt3_max_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec1_reg_t;

/** Type of dly_num_rec2 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site2_delay_num_vt0_max_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt0_max_record:8;
        /** site2_delay_num_vt1_max_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt1_max_record:8;
        /** site2_delay_num_vt2_max_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt2_max_record:8;
        /** site2_delay_num_vt3_max_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt3_max_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec2_reg_t;

/** Type of dly_num_rec3 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site3_delay_num_vt0_max_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt0_max_record:8;
        /** site3_delay_num_vt1_max_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt1_max_record:8;
        /** site3_delay_num_vt2_max_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt2_max_record:8;
        /** site3_delay_num_vt3_max_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt3_max_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec3_reg_t;

/** Type of dly_num_rec4 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site0_delay_num_vt0_min_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt0_min_record:8;
        /** site0_delay_num_vt1_min_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt1_min_record:8;
        /** site0_delay_num_vt2_min_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt2_min_record:8;
        /** site0_delay_num_vt3_min_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site0_delay_num_vt3_min_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec4_reg_t;

/** Type of dly_num_rec5 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site1_delay_num_vt0_min_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt0_min_record:8;
        /** site1_delay_num_vt1_min_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt1_min_record:8;
        /** site1_delay_num_vt2_min_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt2_min_record:8;
        /** site1_delay_num_vt3_min_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site1_delay_num_vt3_min_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec5_reg_t;

/** Type of dly_num_rec6 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site2_delay_num_vt0_min_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt0_min_record:8;
        /** site2_delay_num_vt1_min_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt1_min_record:8;
        /** site2_delay_num_vt2_min_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt2_min_record:8;
        /** site2_delay_num_vt3_min_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site2_delay_num_vt3_min_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec6_reg_t;

/** Type of dly_num_rec7 register
 *  needs field desc
 */
typedef union {
    struct {
        /** site3_delay_num_vt0_min_record : RO; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt0_min_record:8;
        /** site3_delay_num_vt1_min_record : RO; bitpos: [15:8]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt1_min_record:8;
        /** site3_delay_num_vt2_min_record : RO; bitpos: [23:16]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt2_min_record:8;
        /** site3_delay_num_vt3_min_record : RO; bitpos: [31:24]; default: 0;
         *  needs field desc
         */
        uint32_t site3_delay_num_vt3_min_record:8;
    };
    uint32_t val;
} pvt_dly_num_rec7_reg_t;

/** Type of dly_num_rec_clr register
 *  needs field desc
 */
typedef union {
    struct {
        /** delay_num_rec_clr : WT; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_rec_clr:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} pvt_dly_num_rec_clr_reg_t;

/** Type of dly_num_dump_conf register
 *  needs field desc
 */
typedef union {
    struct {
        /** dump_en : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t dump_en:1;
        /** dump_cell_sel : R/W; bitpos: [7:1]; default: 0;
         *  needs field desc
         */
        uint32_t dump_cell_sel:7;
        /** dump_eof_num : R/W; bitpos: [23:8]; default: 65535;
         *  needs field desc
         */
        uint32_t dump_eof_num:16;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} pvt_dly_num_dump_conf_reg_t;

/** Type of pwr_glitch_conf register
 *  needs field desc
 */
typedef union {
    struct {
        /** glitch_efuse_ctrl : R/W; bitpos: [0]; default: 1;
         *  needs field desc
         */
        uint32_t glitch_efuse_ctrl:1;
        /** glitch_en : R/W; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t glitch_en:1;
        /** glitch_cell_sel : R/W; bitpos: [8:2]; default: 0;
         *  needs field desc
         */
        uint32_t glitch_cell_sel:7;
        /** glitch_limit : R/W; bitpos: [24:9]; default: 255;
         *  needs field desc
         */
        uint32_t glitch_limit:16;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} pvt_pwr_glitch_conf_reg_t;

/** Type of dbias_active_time register
 *  needs field desc
 */
typedef union {
    struct {
        /** dbias_active_time : R/W; bitpos: [31:0]; default: 65535;
         *  needs field desc
         */
        uint32_t dbias_active_time:32;
    };
    uint32_t val;
} pvt_dbias_active_time_reg_t;

/** Type of dbias_idle_time register
 *  needs field desc
 */
typedef union {
    struct {
        /** dbias_idle_time : R/W; bitpos: [31:0]; default: 4294967295;
         *  needs field desc
         */
        uint32_t dbias_idle_time:32;
    };
    uint32_t val;
} pvt_dbias_idle_time_reg_t;


/** Group: version register */
/** Type of date register
 *  version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 34677040;
         *  version register
         */
        uint32_t date:32;
    };
    uint32_t val;
} pvt_date_reg_t;


